# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [29]:
series1= pd.Series(np.random.randint(1,4+1,100))
series2 = pd.Series(np.random.randint(1,3+1,100))
series3 = pd.Series(np.random.randint(10000,30000+1,100))

In [30]:
print("s1 :-",series1,"\n")
print("s2 :-",series2,"\n")
print("s3 :- ",series3,"\n")

s1 :- 0     2
1     1
2     3
3     3
4     3
     ..
95    2
96    2
97    3
98    3
99    4
Length: 100, dtype: int32

s2 :- 0     1
1     1
2     1
3     2
4     2
     ..
95    1
96    1
97    2
98    2
99    3
Length: 100, dtype: int32

s3 :-  0     20826
1     10317
2     21832
3     22696
4     26256
      ...
95    21995
96    23504
97    18868
98    10408
99    26500
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [24]:
# series1.reshape(100,1)

In [39]:
df=pd.concat([series1,series2,series3],axis=1)

In [40]:
df

    0  1      2
0   2  1  20826
1   1  1  10317
2   3  1  21832
3   3  2  22696
4   3  2  26256
.. .. ..    ...
95  2  1  21995
96  2  1  23504
97  3  2  18868
98  3  2  10408
99  4  3  26500

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [44]:
df.columns=['bedrs', 'bathrs', 'price_sqr_meter']

In [45]:
df

    bedrs  bathrs  price_sqr_meter
0       2       1            20826
1       1       1            10317
2       3       1            21832
3       3       2            22696
4       3       2            26256
..    ...     ...              ...
95      2       1            21995
96      2       1            23504
97      3       2            18868
98      3       2            10408
99      4       3            26500

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [54]:
bigcolumn = pd.concat([series1,series2,series3])
bigcolumn=bigcolumn.to_frame()

In [55]:
type(bigcolumn)

pandas.core.frame.DataFrame

In [57]:
bigcolumn

        0
0       2
1       1
2       3
3       3
4       3
..    ...
95  21995
96  23504
97  18868
98  10408
99  26500

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [56]:
# no 
#because of 
bigcolumn.shape
# last index of bigclumn is 99 insted of 299

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [61]:
bigcolumn.reset_index()

     index      0
0        0      2
1        1      1
2        2      3
3        3      3
4        4      3
..     ...    ...
295     95  21995
296     96  23504
297     97  18868
298     98  10408
299     99  26500

[300 rows x 2 columns]